Revit 2027 API
DuctPressureDropData.Length Property
 The length of the duct. Units: (ft).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
public:
property double Length {
	double get ();
}
member Length : float with get
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace